In [43]:
import pandas as pd

In [44]:
df = pd.DataFrame(pd.read_csv("./data/raw_data.csv"))

In [45]:
copy = df.copy()
copy

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [46]:
copy["tax"] = copy["income"].apply(lambda x: "20%" if x>=50000 else "10%")

In [47]:
copy

    id          name   age country   gender   income  tax
0    1      John Doe  29.0     USA     Male  55000.0  20%
1    1      John Doe  29.0     USA     Male  55000.0  20%
2    2    Jane Smith   NaN  Canada   Female  62000.0  20%
3    3          Alex   NaN     USA  Unknown  47000.0  10%
4    4  Maria Garcia  34.0   Spain   Female      NaN  10%
5    5        Li Wei  27.0   China     Male  51000.0  20%
6    6           NaN  45.0   India   Female  73000.0  20%
7    7    Ahmed Khan  38.0     NaN     Male  68000.0  20%
8    8    Rachel Lee  29.0     USA   Female  62000.0  20%
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0  10%
10  10   Emily Davis  31.0     USA      NaN  58000.0  20%

In [48]:
gender_map = {"Male": "M","Female":"F","Unknown":"U"}
copy["gender"] = copy["gender"].map(gender_map)
copy

    id          name   age country gender   income  tax
0    1      John Doe  29.0     USA      M  55000.0  20%
1    1      John Doe  29.0     USA      M  55000.0  20%
2    2    Jane Smith   NaN  Canada      F  62000.0  20%
3    3          Alex   NaN     USA      U  47000.0  10%
4    4  Maria Garcia  34.0   Spain      F      NaN  10%
5    5        Li Wei  27.0   China      M  51000.0  20%
6    6           NaN  45.0   India      F  73000.0  20%
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%
8    8    Rachel Lee  29.0     USA      F  62000.0  20%
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%
10  10   Emily Davis  31.0     USA    NaN  58000.0  20%

In [49]:
copy = copy.assign(new_income = copy["income"]*1.1)
copy

    id          name   age country gender   income  tax  new_income
0    1      John Doe  29.0     USA      M  55000.0  20%     60500.0
1    1      John Doe  29.0     USA      M  55000.0  20%     60500.0
2    2    Jane Smith   NaN  Canada      F  62000.0  20%     68200.0
3    3          Alex   NaN     USA      U  47000.0  10%     51700.0
4    4  Maria Garcia  34.0   Spain      F      NaN  10%         NaN
5    5        Li Wei  27.0   China      M  51000.0  20%     56100.0
6    6           NaN  45.0   India      F  73000.0  20%     80300.0
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%     74800.0
8    8    Rachel Lee  29.0     USA      F  62000.0  20%     68200.0
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%     49500.0
10  10   Emily Davis  31.0     USA    NaN  58000.0  20%     63800.0

In [50]:
copy["country"] = copy["country"].replace("USA","US")
copy

    id          name   age country gender   income  tax  new_income
0    1      John Doe  29.0      US      M  55000.0  20%     60500.0
1    1      John Doe  29.0      US      M  55000.0  20%     60500.0
2    2    Jane Smith   NaN  Canada      F  62000.0  20%     68200.0
3    3          Alex   NaN      US      U  47000.0  10%     51700.0
4    4  Maria Garcia  34.0   Spain      F      NaN  10%         NaN
5    5        Li Wei  27.0   China      M  51000.0  20%     56100.0
6    6           NaN  45.0   India      F  73000.0  20%     80300.0
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%     74800.0
8    8    Rachel Lee  29.0      US      F  62000.0  20%     68200.0
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%     49500.0
10  10   Emily Davis  31.0      US    NaN  58000.0  20%     63800.0

In [51]:
copy.rename(columns={"new_income":"new income"},inplace=True)
copy

    id          name   age country gender   income  tax  new income
0    1      John Doe  29.0      US      M  55000.0  20%     60500.0
1    1      John Doe  29.0      US      M  55000.0  20%     60500.0
2    2    Jane Smith   NaN  Canada      F  62000.0  20%     68200.0
3    3          Alex   NaN      US      U  47000.0  10%     51700.0
4    4  Maria Garcia  34.0   Spain      F      NaN  10%         NaN
5    5        Li Wei  27.0   China      M  51000.0  20%     56100.0
6    6           NaN  45.0   India      F  73000.0  20%     80300.0
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%     74800.0
8    8    Rachel Lee  29.0      US      F  62000.0  20%     68200.0
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%     49500.0
10  10   Emily Davis  31.0      US    NaN  58000.0  20%     63800.0

In [52]:
min_income = copy["income"].min()
min_income

45000.0

In [53]:
copy["Ranking"] = copy["income"].rank()
copy.rename(columns={"Ranking":"ranking"})

    id          name   age country gender   income  tax  new income  ranking
0    1      John Doe  29.0      US      M  55000.0  20%     60500.0      4.5
1    1      John Doe  29.0      US      M  55000.0  20%     60500.0      4.5
2    2    Jane Smith   NaN  Canada      F  62000.0  20%     68200.0      7.5
3    3          Alex   NaN      US      U  47000.0  10%     51700.0      2.0
4    4  Maria Garcia  34.0   Spain      F      NaN  10%         NaN      NaN
5    5        Li Wei  27.0   China      M  51000.0  20%     56100.0      3.0
6    6           NaN  45.0   India      F  73000.0  20%     80300.0     10.0
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%     74800.0      9.0
8    8    Rachel Lee  29.0      US      F  62000.0  20%     68200.0      7.5
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%     49500.0      1.0
10  10   Emily Davis  31.0      US    NaN  58000.0  20%     63800.0      6.0

In [56]:
id = copy["id"]
id
copy = copy.drop("id",axis=1)

In [41]:
columns = copy.columns
columns

Index(['name', 'age', 'country', 'gender', 'income', 'tax', 'new income',
       'Ranking'],
      dtype='object')

In [59]:
copy["id"] = id
copy

            name   age country gender   income  tax  new income  Ranking  id
0       John Doe  29.0      US      M  55000.0  20%     60500.0      4.5   1
1       John Doe  29.0      US      M  55000.0  20%     60500.0      4.5   1
2     Jane Smith   NaN  Canada      F  62000.0  20%     68200.0      7.5   2
3           Alex   NaN      US      U  47000.0  10%     51700.0      2.0   3
4   Maria Garcia  34.0   Spain      F      NaN  10%         NaN      NaN   4
5         Li Wei  27.0   China      M  51000.0  20%     56100.0      3.0   5
6            NaN  45.0   India      F  73000.0  20%     80300.0     10.0   6
7     Ahmed Khan  38.0     NaN      M  68000.0  20%     74800.0      9.0   7
8     Rachel Lee  29.0      US      F  62000.0  20%     68200.0      7.5   8
9    Carlos Ruiz   NaN  Mexico      M  45000.0  10%     49500.0      1.0   9
10   Emily Davis  31.0      US    NaN  58000.0  20%     63800.0      6.0  10